#+title: JLS Emacs
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes :results output silent

** Centering

#+begin_src emacs-lisp
(defun jls/org-mode-visual-fill ()
  (interactive)
  (setq
   visual-fill-column-width 100
   visual-fill-column-fringes-outside-margins nil
   ; This makes the gutter annotations appear closer ^
   visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow)
   ; This makes it so that you can still see the line wrappings from the gutter.
   visual-fill-column-center-text t)
  (visual-line-mode)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :ensure t
  :hook (org-mode . jls/org-mode-visual-fill))
#+end_src

#+RESULTS:
| #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (display-line-numbers-mode 0)) | (lambda nil (add-hook 'after-save-hook #'jls/org-babel-tangle-config)) | jls/org-mode-visual-fill | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

* Opening common files

#+begin_src emacs-lisp
(defun open-bash-profile ()
  "Opens bash_profile"
  (interactive)
  (find-file "~/.bash_profile"))

(defun open-bash-profile-org ()
  "Opens the org file I use to generate my bash_profile"
  (interactive)
  (find-file "~/projects/dotfiles/bash/bash-profile.org"))
#+end_src

Trick for auto-tangling. Taken from [[https://github.com/daviwil/emacs-from-scratch/blob/9388cf6ecd9b44c430867a5c3dad5f050fdc0ee1/Emacs.org][here]].

Is there a way of forcing the save?

#+begin_src emacs-lisp
; files for auto-tangling
(setq files-for-auto-tangling
      (mapcar
       'expand-file-name
       '("~/projects/dotfiles/bash/bash-profile.org"
         "~/projects/dotfiles/emacs/Emacs.org")))

;; Automatically tangle our Emacs.org config file when we save it
(defun jls/org-babel-tangle-config ()
  (interactive)
  (when (member (buffer-file-name) files-for-auto-tangling)
    ;; We also want to transclude every time we save
    ;; ... so we get the transcluded blocks 
    (org-transclusion-add-all)
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle)))
  (org-transclusion-remove-all))

(add-hook 'org-mode-hook
  (lambda ()
    (add-hook 'after-save-hook
      #'jls/org-babel-tangle-config)))
#+end_src

#+RESULTS:
| (lambda nil (add-hook 'after-save-hook #'jls/org-babel-tangle-config)) | jls/org-mode-visual-fill | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (display-line-numbers-mode 0)) |

#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages '((R . t) (emacs-lisp . t)))
#+end_src

#+RESULTS:

** Project management

This is again almost all from the Emacs from Scratch series.

#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/projects")
    (setq projectile-project-search-path '("~/projects"))
    (setq projectile-switch-project-action #'projectile-dired)))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (use-package-autoload-keymap 'projectile-command-map 'projectile nil) |


#+begin_src emacs-lisp
(use-package ess
  :init (setq ess-startup-directory 'default-directory))
#+end_src

#+RESULTS:

Code for working out whether a folder is an R project or not.

#+begin_src emacs-lisp
(defun jls/r-proj-p (dir)
  (if (eval
       (cons
        'or
        (mapcar
         (lambda (vec) (string-match ".Rproj" vec))
         (directory-files dir))))
      t
    nil))
#+end_src

#+RESULTS:
: jls/r-proj-p

It would be interesting to see what to do with buffer local variables?

What to do when opening an R project.

An idea is to capture various trailing command arguments when starting R. Then in .RProfile, optionally incorporate them somehow. Notably, set the working directory silently. I'm not sure how RStudio does it.

#+begin_src emacs-lisp
(defun jls/open-r-project ()
  (interactive)
  (R))
#+end_src

#+RESULTS:
: jls/open-r-project

A better solution would be to have the generic open project actions in their own function. And all the project specific actions can call that one. Classic remove duplication.

#+begin_src emacs-lisp
(defun jls/open-project ()
  (interactive)
  (cond
   ((jls/r-proj-p (projectile-project-root))
    (jls/open-r-project))
   (t
    projectile-dired)))
#+end_src

#+RESULTS:
: jls/open-project

#+begin_src emacs-lisp
(setq projectile-switch-project-action 'jls/open-project)
#+end_src

#+RESULTS:
: jls/open-project

#+begin_src emacs-lisp
(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src

#+RESULTS:
: t

* Window management

#+begin_src emacs-lisp
  (setq switch-to-buffer-obey-display-actions nil)
  ;(setq switch-to-buffer-in-dedicated-window "pop")

  ; (add-to-list
  ;  'display-buffer-alist
  ;  '("\\*jls" (display-buffer-reuse-window
  ;     display-buffer-pop-up-window)))

  (add-to-list
   'display-buffer-alist
   '("\\*helpful"
     (display-buffer-in-side-window)
     (window-width . 95)
     (side . right)))

  (add-to-list
   'display-buffer-alist
   '("\\*Warnings\\*" (display-buffer-in-side-window) (side . right)))

  (add-to-list
   'display-buffer-alist
   '("\\*R"
     display-buffer-in-direction
     (direction . bottom)
     (window . root)
     (window-height . 0.3)))
#+end_src

#+RESULTS:
| \*R          | display-buffer-in-direction     | (direction . bottom) | (window . root) | (window-height . 0.3) |
| \*Warnings\* | (display-buffer-in-side-window) | (side . right)       |                 |                       |
| \*helpful    | (display-buffer-in-side-window) | (side . right)       |                 |                       |

** Edwina

#+begin_src emacs-lisp
;(use-package edwina
;  :ensure t
;  :config (setq display-buffer-base-action '(display-buffer-below-selected))
;  ;;(edwina-setup-dwm-keys)
;  (edwina-mode 1))

;(setq display-buffer-base-action '(display-buffer-below-selected))
#+end_src

#+RESULTS:
| display-buffer-below-selected |

